package main

import "fmt"

func main() {
	fmt.Print("" +
		"  ███████╗██╗   ██╗██████╗ ██████╗ ███████╗███╗   ███╗ █████╗ ████████╗██╗ ██╗  ██╗\n" +
		"  ██╔════╝██║   ██║██╔══██╗██╔══██╗██╔════╝████╗ ████║██╔══██╗╚══██╔══╝██║ ██║ ██╔╝\n" +
		"  ███████╗██║   ██║██████╔╝██████╔╝█████╗  ██╔████╔██║███████║   ██║   ██║ ████══╝ \n" +
		"  ╚════██║██║   ██║██╔═══╝ ██╔══██╗██╔══╝  ██║╚██╔╝██║██╔══██║   ██║   ██║ ██╔═██╗ \n" +
		"  ███████║╚██████╔╝██║     ██║  ██║███████╗██║ ╚═╝ ██║██║  ██║   ██║   ██║ ██║  ██╗\n" +
		"  ╚══════╝ ╚═════╝ ╚═╝     ╚═╝  ╚═╝╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝   ╚═╝   ╚═╝ ╚═╝  ╚═╝\n\n" +
		"                   ██████╗██╗  ██╗███████╗ █████╗ ████████╗\n" +
		"                  ██╔════╝██║  ██║██╔════╝██╔══██╗╚══██╔══╝\n" +
		"                  ██║     ███████║█████╗  ███████║   ██║   \n" +
		"                  ██║     ██╔══██║██╔══╝  ██╔══██║   ██║   \n" +
		"                  ╚██████╗██║  ██║███████╗██║  ██║   ██║   \n" +
		"                   ╚═════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝   ╚═╝   \n\n")
	fmt.Println("Выберите действие:")
	fmt.Println("⭐ 1. Запустить чит на звезды")
	fmt.Println("🚂 2. Запустить чит на предметы")
	fmt.Println("⭐ 3. Подгрузить новые треды")
	fmt.Println("⭐ 1212. Заново загрузить базу тредов")
	fmt.Print(">>> ")

	var choice int
	fmt.Scanln(&choice)

	switch choice {
	case 1:
		RunPostLoop()
	case 2:
		RunSteamCheat()

	case 3:
		UpdateDatabaseWithNewWhitelistThreads()
	case 1212:
		LoadDatabase()
	default:
		fmt.Println("Неизвестная команда")
	}
}
